app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE (due_date='2017-01-08')
---
  def index
    render json: Todo.all

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    render json: Todo.find(params[:id])

INSERT INTO "todos" ("title", "owner", "complete", "created_at", "updated_at", "due_date") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdfg"], ["owner", "chip.irek@gmail.com"], ["complete", "f"], ["created_at", "2017-10-13 17:46:42.029031"], ["updated_at", "2017-10-13 17:46:42.029031"], ["due_date", "2017-10-13"]]
---
  def create
    todo = Todo.new(todo_params)

    if todo.save!

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "todos" SET "complete" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["complete", "t"], ["updated_at", "2017-09-21 22:12:36.176704"], ["id", 4]]
---
  def update
    todo = Todo.find(params[:id])
    if todo.update!(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 73], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 73]]
---
  def destroy
    todo = Todo.find(params[:id])
    if todo.destroy!

SELECT "todos".* FROM "todos" WHERE (complete = 't')
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 77]]
---
  def clear_complete
    todos = Todo.where("complete = 't'")
    todos.each do |todo|
      todo.destroy

SELECT "todos".* FROM "todos" WHERE ((complete is null and due_date<'2017-10-08') or (complete = 'f' and due_date<'2017-10-08') or (due_date='2017-10-08'))
---
  def set_todo
    @todo = Todo.find(params[:id])